---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValidRealGreaterThan
source: html/9dd9400f-bb22-2cc8-9514-38ab44d1af31.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterValidRealGreaterThan Property

Enter a number greater than [Value].

## Syntax (C#)
```csharp
public static FailureDefinitionId EnterValidRealGreaterThan { get; }
```